# SELECT, INSERT, UPDATE, DELETE
Summary:
This code snippet demonstrates the basic SQL statements: SELECT, INSERT, UPDATE, and DELETE. It starts by creating a table called "employees" with columns for id, name, age, and salary. Then, it inserts some sample data into the table. 

The SELECT statement is used to retrieve data from the table. It shows examples of selecting all rows and specific columns, as well as filtering rows based on a condition using the WHERE clause.

The UPDATE statement is used to modify the data in a specific row. In this case, it updates the salary of an employee with id 2.

The DELETE statement is used to remove a row from the table. In this case, it deletes the employee with id 1.

Finally, the SELECT statement is used again to show the remaining rows in the table after the update and delete operations.

These basic SQL statements are fundamental for interacting with databases and manipulating data.

In [ ]:
-- Create a table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000.00),
       (2, 'Jane Smith', 25, 60000.00),
       (3, 'Mike Johnson', 35, 70000.00);

-- Select all rows from the table
SELECT * FROM employees;
-- Expected output: 
-- id |     name     | age |  salary  
-- ----+--------------+-----+----------
--  1  | John Doe     |  30 | 50000.00
--  2  | Jane Smith   |  25 | 60000.00
--  3  | Mike Johnson |  35 | 70000.00

-- Select specific columns from the table
SELECT name, age FROM employees;
-- Expected output: 
--     name     | age 
-- --------------+-----
--  John Doe     |  30
--  Jane Smith   |  25
--  Mike Johnson |  35

-- Select rows based on a condition
SELECT * FROM employees WHERE age > 30;
-- Expected output: 
-- id |     name     | age |  salary  
-- ----+--------------+-----+----------
--  3  | Mike Johnson |  35 | 70000.00

-- Update a row in the table
UPDATE employees SET salary = 75000.00 WHERE id = 2;

-- Delete a row from the table
DELETE FROM employees WHERE id = 1;

-- Select the remaining rows from the table
SELECT * FROM employees;
-- Expected output: 
-- id |     name     | age |  salary  
-- ----+--------------+-----+----------
--  2  | Jane Smith   |  25 | 75000.00
--  3  | Mike Johnson |  35 | 70000.00

# WHERE clause and Filter Conditions
Explanation:
This code snippet demonstrates the usage of the `WHERE` clause and filter conditions in SQL. The `WHERE` clause is used to filter rows based on specified conditions. Here are the different examples covered:

1. Selecting all employees: This query retrieves all rows from the `employees` table.
2. Selecting employees with age greater than 30: This query filters the rows where the `age` column is greater than 30.
3. Selecting employees with salary between 5500 and 6500: This query filters the rows where the `salary` column is between 5500 and 6500.
4. Selecting employees with names starting with 'J': This query filters the rows where the `name` column starts with 'J'.
5. Selecting employees with names ending with 'n': This query filters the rows where the `name` column ends with 'n'.
6. Selecting employees with names containing 'mi': This query filters the rows where the `name` column contains 'mi'.
7. Selecting employees with age less than or equal to 30 and salary greater than 5500: This query filters the rows where the `age` column is less than or equal to 30 and the `salary` column is greater than 5500.
8. Selecting employees with age greater than 30 or salary less than 5500: This query filters the rows where the `age` column is greater than 30 or the `salary` column is less than 5500.
9. Selecting employees with age not equal to 30: This query filters the rows where the `age` column is not equal to 30.
10. Selecting employees with NULL salary: This query filters the rows where the `salary` column is NULL.
11. Selecting employees with non-NULL salary: This query filters the rows where the `salary` column is not NULL.
12. Selecting employees with age greater than 30 and salary greater than 6000, ordered by salary in descending order: This query filters the rows where the `age` column is greater than 30 and the `salary` column is greater than 6000, and then orders the result by the `salary` column in descending order.
13. Selecting the maximum salary from employees: This query retrieves the maximum value from the `salary` column.
14. Selecting the minimum salary from employees: This query retrieves the minimum value from the `salary` column.
15. Selecting the average salary from employees: This query calculates the average value of the `salary` column.
16. Selecting the total salary from employees: This query calculates the sum of the `salary` column.
17. Selecting the number of employees: This query counts the number of rows in the `employees` table.
18. Deleting employees with age less than 30: This query deletes rows from the `employees` table where the `age` column is less than 30.
19. Updating salary of employees with age greater than 30: This query updates the `salary` column of rows in the `employees` table where the `age` column is greater than 30 by adding 1000 to the existing salary.

In [ ]:
-- Create a table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert some data
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 5000),
       (2, 'Jane Smith', 25, 6000),
       (3, 'Mike Johnson', 35, 7000),
       (4, 'Emily Davis', 28, 5500),
       (5, 'David Brown', 32, 6500);

-- Select all employees
SELECT * FROM employees;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  1  | John Doe     |  30 | 5000.00
--  2  | Jane Smith   |  25 | 6000.00
--  3  | Mike Johnson |  35 | 7000.00
--  4  | Emily Davis  |  28 | 5500.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with age greater than 30
SELECT * FROM employees WHERE age > 30;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 7000.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with salary between 5500 and 6500
SELECT * FROM employees WHERE salary BETWEEN 5500 AND 6500;
-- Expected output:
-- id |    name    | age | salary
-- ----+------------+-----+--------
--  1  | John Doe   |  30 | 5000.00
--  4  | Emily Davis|  28 | 5500.00
--  5  | David Brown|  32 | 6500.00

-- Select employees with names starting with 'J'
SELECT * FROM employees WHERE name LIKE 'J%';
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  1  | John Doe     |  30 | 5000.00
--  2  | Jane Smith   |  25 | 6000.00
--  3  | Mike Johnson |  35 | 7000.00

-- Select employees with names ending with 'n'
SELECT * FROM employees WHERE name LIKE '%n';
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  1  | John Doe     |  30 | 5000.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with names containing 'mi'
SELECT * FROM employees WHERE name LIKE '%mi%';
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 7000.00
--  4  | Emily Davis  |  28 | 5500.00

-- Select employees with age less than or equal to 30 and salary greater than 5500
SELECT * FROM employees WHERE age <= 30 AND salary > 5500;
-- Expected output:
-- id |    name    | age | salary
-- ----+------------+-----+--------
--  4  | Emily Davis|  28 | 5500.00

-- Select employees with age greater than 30 or salary less than 5500
SELECT * FROM employees WHERE age > 30 OR salary < 5500;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 7000.00
--  4  | Emily Davis  |  28 | 5500.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with age not equal to 30
SELECT * FROM employees WHERE age <> 30;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  2  | Jane Smith   |  25 | 6000.00
--  3  | Mike Johnson |  35 | 7000.00
--  4  | Emily Davis  |  28 | 5500.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with NULL salary
SELECT * FROM employees WHERE salary IS NULL;
-- No rows will be returned since we don't have any NULL values in the salary column

-- Select employees with non-NULL salary
SELECT * FROM employees WHERE salary IS NOT NULL;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  1  | John Doe     |  30 | 5000.00
--  2  | Jane Smith   |  25 | 6000.00
--  3  | Mike Johnson |  35 | 7000.00
--  4  | Emily Davis  |  28 | 5500.00
--  5  | David Brown  |  32 | 6500.00

-- Select employees with age greater than 30 and salary greater than 6000, ordered by salary in descending order
SELECT * FROM employees WHERE age > 30 AND salary > 6000 ORDER BY salary DESC;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 7000.00
--  5  | David Brown  |  32 | 6500.00

-- Select the maximum salary from employees
SELECT MAX(salary) FROM employees;
-- Expected output:
-- max
-- ------
-- 7000.00

-- Select the minimum salary from employees
SELECT MIN(salary) FROM employees;
-- Expected output:
-- min
-- ------
-- 5000.00

-- Select the average salary from employees
SELECT AVG(salary) FROM employees;
-- Expected output:
-- avg
-- ------
-- 6000.00

-- Select the total salary from employees
SELECT SUM(salary) FROM employees;
-- Expected output:
-- sum
-- ------
-- 30000.00

-- Select the number of employees
SELECT COUNT(*) FROM employees;
-- Expected output:
-- count
-- ------
-- 5

-- Delete employees with age less than 30
DELETE FROM employees WHERE age < 30;

-- Select all employees after deletion
SELECT * FROM employees;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 7000.00
--  5  | David Brown  |  32 | 6500.00

-- Update salary of employees with age greater than 30
UPDATE employees SET salary = salary + 1000 WHERE age > 30;

-- Select all employees after salary update
SELECT * FROM employees;
-- Expected output:
-- id |     name     | age | salary
-- ----+--------------+-----+--------
--  3  | Mike Johnson |  35 | 8000.00
--  5  | David Brown  |  32 | 7500.00

# Operators (e.g., =, <>, >, <, etc.)
Explanation:
This code snippet demonstrates the usage of operators in SQL statements. The `=` operator is used for exact matches, `<>` for inequality, `>`, `<`, `<=`, and `>=` for comparison, and `LIKE` for pattern matching. The code creates a table called "employees" and inserts some sample data. Then, various SELECT statements are used to retrieve specific rows based on different conditions using the operators. The expected output is also provided for each SELECT statement.

In [ ]:
-- Create a table called "employees"
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert some sample data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 25, 60000),
       (3, 'Mike Johnson', 35, 70000),
       (4, 'Emily Davis', 28, 55000);

-- Select all employees with age greater than 30
SELECT * FROM employees WHERE age > 30;
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  3 | Mike Johnson|  35 | 70000

-- Select employees with salary less than or equal to 55000
SELECT * FROM employees WHERE salary <= 55000;
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  1 | John Doe    |  30 | 50000
--  4 | Emily Davis |  28 | 55000

-- Select employees with name not equal to 'John Doe'
SELECT * FROM employees WHERE name <> 'John Doe';
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  2 | Jane Smith  |  25 | 60000
--  3 | Mike Johnson|  35 | 70000
--  4 | Emily Davis |  28 | 55000

-- Select employees with age between 25 and 30 (inclusive)
SELECT * FROM employees WHERE age BETWEEN 25 AND 30;
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  1 | John Doe    |  30 | 50000
--  4 | Emily Davis |  28 | 55000

-- Select employees with salary outside the range of 55000 to 70000
SELECT * FROM employees WHERE salary NOT BETWEEN 55000 AND 70000;
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  1 | John Doe    |  30 | 50000
--  2 | Jane Smith  |  25 | 60000

-- Select employees with name starting with 'J'
SELECT * FROM employees WHERE name LIKE 'J%';
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  1 | John Doe    |  30 | 50000
--  2 | Jane Smith  |  25 | 60000

-- Select employees with name ending with 'son'
SELECT * FROM employees WHERE name LIKE '%son';
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  3 | Mike Johnson|  35 | 70000

-- Select employees with name containing 'mi'
SELECT * FROM employees WHERE name LIKE '%mi%';
-- Expected output: 
-- id |    name     | age | salary
-- ----+-------------+-----+--------
--  3 | Mike Johnson|  35 | 70000
--  4 | Emily Davis |  28 | 55000

# Aggregate Functions (e.g., COUNT, SUM, AVG)
Explanation:
In this code snippet, we demonstrate the usage of aggregate functions in SQL, specifically the COUNT, SUM, and AVG functions.

First, we create a table called "employees" to store employee information. We then insert sample data into the table.

To count the number of employees, we use the COUNT(*) function, which counts all rows in the table. The result is aliased as "total_employees".

To calculate the sum of all employee salaries, we use the SUM(salary) function, which adds up the values in the "salary" column. The result is aliased as "total_salary".

To calculate the average age of employees, we use the AVG(age) function, which calculates the average of the values in the "age" column. The result is aliased as "average_age".

We can also use aggregate functions in combination with other clauses. In the next example, we count the number of employees with a salary greater than 50000. We use the WHERE clause to filter the rows based on the salary condition.

Lastly, we calculate the sum of salaries for employees aged 30 or younger. We use the WHERE clause to filter the rows based on the age condition.

Each query is executed and the expected output is mentioned in the comments after the print statements.

In [ ]:
-- Create a table to store employee information
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert sample data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 35, 60000),
       (3, 'Mike Johnson', 40, 70000),
       (4, 'Emily Davis', 25, 45000),
       (5, 'David Brown', 45, 80000);

-- Count the number of employees
SELECT COUNT(*) AS total_employees FROM employees;
-- Expected output: total_employees = 5

-- Calculate the sum of all employee salaries
SELECT SUM(salary) AS total_salary FROM employees;
-- Expected output: total_salary = 305000.00

-- Calculate the average age of employees
SELECT AVG(age) AS average_age FROM employees;
-- Expected output: average_age = 35.00

-- Count the number of employees with a salary greater than 50000
SELECT COUNT(*) AS high_salary_employees
FROM employees
WHERE salary > 50000;
-- Expected output: high_salary_employees = 3

-- Calculate the sum of salaries for employees aged 30 or younger
SELECT SUM(salary) AS total_salary_young_employees
FROM employees
WHERE age <= 30;
-- Expected output: total_salary_young_employees = 95000.00